Reports/ур_СводныйРеестрЗерновыхРасписок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ур_СводныйРеестрЗерновыхРасписок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСравненияНоменклатура</Name>
					<Type>
						<v8:Type>ent:ComparisonType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаОрганизаций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаПодразделений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтрицательноеКрасным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравненияОрганизации</Name>
					<Type>
						<v8:Type>ent:ComparisonType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравненияСклад</Name>
					<Type>
						<v8:Type>ent:ComparisonType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборНоменклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccountingRegisters/Типовой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>Типовой</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Типовой</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Типовой.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Типовой.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Типовой.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Типовой.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Типовой.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Типовой.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегламентнойОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/ур_ПереоформлениеЗерновыхРасписок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ур_ПереоформлениеЗерновыхРасписок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ур_ПогашенияЗерновыхРасписок</xr:Item>
				<xr:Item>AccumulationRegister.ур_ЗабронированноеЗерно</xr:Item>
				<xr:Item>AccumulationRegister.ур_ЗерноНаСкладах</xr:Item>
				<xr:Item>InformationRegister.ур_СтатусыЗерновыхРасписок</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
				<xr:Item>AccumulationRegister.ур_ДвиженияЗерна</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ур_ВидыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗерноваяРасписка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ур_ЗерноваяРасписка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗабронировано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвиженияЗерна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ур_ВидыДвиженияЗерна</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБронирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ур_ВидыОперацийБронирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяЗерноваяРасписка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ур_ЗерноваяРасписка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>нКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>нЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>нСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ур_СводныйРеестрЗерновыхРасписок/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда

Функция СформироватьЗапрос()
	
	мСчетаУчета = Новый Массив;
	
	Если ЗНАЧЕНИЕЗАПОЛНЕНО(СчетУчета) ТОгда
		мСчетаУчета.Добавить(СчетУчета);	
	Иначе
		мСчетаУчета.Добавить(ПланыСчетов.Типовой.КоммерческиеРесурсыЗерна);
	КонецЕсли;
	
	
	мВидыСубконто = Новый Массив;
	мВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Склады);
	мВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Номенклатура);
	мВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Партии);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("мВидыСубконто", мВидыСубконто);
	Запрос.УстановитьПараметр("ВыбСчетУчета", мСчетаУчета);
	
	ТекстУсловия = "";
	ТекстДопУсловия = "";
	Союз = "";
	
	
	Если ОтборОрганизации Тогда
		
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Если ВидСравненияОрганизации = ВидСравнения.Равно Тогда
			ВидСравненияОрганизацииСтрокой = " = &Организация" 
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.НеРавно Тогда
			ВидСравненияОрганизацииСтрокой = " <> &Организация"
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.ВСписке Тогда
			ВидСравненияОрганизацииСтрокой = " В (&Организация)"
		Иначе
			ВидСравненияОрганизацииСтрокой = " НЕ В (&Организация)"
		КонецЕсли; 
		
		ТекстУсловия = ТекстУсловия + Союз + "Организация " + ВидСравненияОрганизацииСтрокой;
		ТекстДопУсловия = ТекстДопУсловия + Союз + "Организация " + ВидСравненияОрганизацииСтрокой;
		Союз         = " И ";
		
	КонецЕсли;
	
	Если ОтборСклад Тогда
		
		Запрос.УстановитьПараметр("Склад", Склад);
		
		Если ВидСравненияСклад = ВидСравнения.Равно Тогда
			ВидСравненияСкладСтрокой = " = &Склад" 
		ИначеЕсли ВидСравненияСклад = ВидСравнения.НеРавно Тогда
			ВидСравненияСкладСтрокой = " <> &Склад"
		ИначеЕсли ВидСравненияСклад = ВидСравнения.ВСписке Тогда
			ВидСравненияСкладСтрокой = " В (&Склад)"
		ИначеЕсли ВидСравненияСклад = ВидСравнения.НеВСписке Тогда
			ВидСравненияСкладСтрокой = " НЕ В (&Склад)"
		ИначеЕсли ВидСравненияСклад = ВидСравнения.ВСпискеПоИерархии 
		      ИЛИ ВидСравненияСклад = ВидСравнения.ВИерархии Тогда
			ВидСравненияСкладСтрокой = " В ИЕРАРХИИ (&Склад)"
		ИначеЕсли ВидСравненияСклад = ВидСравнения.НеВСпискеПоИерархии 
		      ИЛИ ВидСравненияСклад = ВидСравнения.НеВИерархии Тогда
			ВидСравненияСкладСтрокой = " НЕ В ИЕРАРХИИ (&Склад)"
		КонецЕсли; 
		
		ТекстУсловия = ТекстУсловия + Союз + "Субконто1 " + ВидСравненияСкладСтрокой;
		ТекстДопУсловия = ТекстДопУсловия + Союз + "СубконтоДт1 " + ВидСравненияСкладСтрокой;
		Союз         = " И ";
		
	КонецЕсли;
	
	
	Если ОтборНоменклатура Тогда
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Если ВидСравненияНоменклатура = ВидСравнения.Равно Тогда
			ВидСравненияНоменклатураСтрокой = " = &Номенклатура" 
		ИначеЕсли ВидСравненияНоменклатура = ВидСравнения.НеРавно Тогда
			ВидСравненияНоменклатураСтрокой = " <> &Номенклатура"
		ИначеЕсли ВидСравненияНоменклатура = ВидСравнения.ВСписке Тогда
			ВидСравненияНоменклатураСтрокой = " В (&Номенклатура)"
		ИначеЕсли ВидСравненияНоменклатура = ВидСравнения.НеВСписке Тогда
			ВидСравненияНоменклатураСтрокой = " НЕ В (&Номенклатура)"
		ИначеЕсли ВидСравненияНоменклатура = ВидСравнения.ВСпискеПоИерархии 
		      ИЛИ ВидСравненияНоменклатура = ВидСравнения.ВИерархии Тогда
			ВидСравненияНоменклатураСтрокой = " В ИЕРАРХИИ (&Номенклатура)"
		ИначеЕсли ВидСравненияНоменклатура = ВидСравнения.НеВСпискеПоИерархии 
		      ИЛИ ВидСравненияНоменклатура = ВидСравнения.НеВИерархии Тогда
			ВидСравненияНоменклатураСтрокой = " НЕ В ИЕРАРХИИ (&Номенклатура)"
		КонецЕсли; 
		
		ТекстУсловия = ТекстУсловия + Союз + "Субконто2 " + ВидСравненияНоменклатураСтрокой;
		ТекстДопУсловия = ТекстДопУсловия + Союз + "СубконтоДт2 " + ВидСравненияНоменклатураСтрокой;
		Союз         = " И ";
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Вн_Запрос.ХПП КАК ХПП,
	|	Вн_Запрос.НОМЕНКЛАТУРА КАК НОМЕНКЛАТУРА,
	|	Вн_Запрос.ЗерноваяРасписка КАК ЗерноваяРасписка,
	|	Сумма(Вн_Запрос.КоличествоНачальныйОстатокДт) КАК КоличествоНачальныйОстатокДт,
	|	Сумма(Вн_Запрос.КоличествоКонечныйОстатокДт) КАК КоличествоКонечныйОстатокДт,
	|	Сумма(Вн_Запрос.КоличествоОборотДт) КАК КоличествоОборотДт,
	|	Сумма(Вн_Запрос.КоличествоОборотКт) КАК КоличествоОборотКт,
	|	Сумма(Вн_Запрос.Закуп) КАК Закуп,
	|	Сумма(Вн_Запрос.Перемещение) КАК Перемещение,
	|	Сумма(Вн_Запрос.Замена) КАК Замена,
	|	Сумма(Вн_Запрос.Перевод) КАК Перевод
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТиповойОстаткиИОбороты.Субконто1 КАК ХПП,
	|		ТиповойОстаткиИОбороты.Субконто2 КАК НОМЕНКЛАТУРА,
	|		ТиповойОстаткиИОбороты.Субконто3 КАК ЗерноваяРасписка,
	|		ТиповойОстаткиИОбороты.КоличествоНачальныйОстатокДт КАК КоличествоНачальныйОстатокДт,
	|		ТиповойОстаткиИОбороты.КоличествоКонечныйОстатокДт КАК КоличествоКонечныйОстатокДт,
	|		ТиповойОстаткиИОбороты.КоличествоОборотДт КАК КоличествоОборотДт,
	|		ТиповойОстаткиИОбороты.КоличествоОборотКт КАК КоличествоОборотКт,
	|		0 КАК Закуп,
	|		0 КАК Перемещение,
	|		0 КАК Замена,
	|		0 КАК Перевод
	|	ИЗ
	|		РегистрБухгалтерии.Типовой.ОстаткиИОбороты(
	|			&НачПериода,
	|			&КонПериода,
	|			,
	|			,
	|			Счет В ИЕРАРХИИ(&выбСчетУчета),
	|			&мВидыСубконто,"+ТекстУсловия+") КАК ТиповойОстаткиИОбороты
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		ТиповойОборотыДтКт.СубконтоДт1 КАК ХПП,
	|		ТиповойОборотыДтКт.СубконтоДт2 КАК Номенклатура,
	|		ТиповойОборотыДтКт.СубконтоДт3 КАК ЗероваяРасписка,
	|		0 КАК КоличествоНачальныйОстатокДт,
	|		0 КАК КоличествоКонечныйОстатокДт,
	|		0 КАК КоличествоОборотДт,
	|		0 КАК КоличествоОборотКт,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ТиповойОборотыДтКт.Регистратор) = ТИП(Документ.ур_ПоступлениеЗерна)
	|			ТОГДА ТиповойОборотыДтКт.КоличествоОборотДт
	|	    	ИНАЧЕ 0
	|		КОНЕЦ КАК Закуп,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ТиповойОборотыДтКт.Регистратор) = ТИП(Документ.ур_ПеремещениеЗерна)
	|			ТОГДА ТиповойОборотыДтКт.КоличествоОборотДт
	|	    	ИНАЧЕ 0
	|		КОНЕЦ КАК Перемещение,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ТиповойОборотыДтКт.Регистратор) = ТИП(Документ.ур_ПереоформлениеЗерновыхРасписок)
	|			ТОГДА ТиповойОборотыДтКт.КоличествоОборотДт
	|	    	ИНАЧЕ 0
	|		КОНЕЦ КАК Замена,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ТиповойОборотыДтКт.Регистратор) = ТИП(Документ.ур_ПереоформлениеРесурсов)
	|			ТОГДА ТиповойОборотыДтКт.КоличествоОборотДт
	|	    	ИНАЧЕ 0
	|		КОНЕЦ КАК Перевод
	|	ИЗ
	|		РегистрБухгалтерии.Типовой.ОборотыДтКт(&НачПериода, 
	|										   &КонПериода, 
	|											Регистратор,
	|											СчетДт В ИЕРАРХИИ (&ВыбСчетУчета),
	|											&мВидыСубконто,
	|											,
	|											,"+ТекстДопУсловия+"
	|											) КАК ТиповойОборотыДтКт
	|  ) КАК Вн_Запрос	
	|СГРУППИРОВАТЬ ПО Вн_Запрос.ХПП,
	|                 Вн_Запрос.НОМЕНКЛАТУРА,
	|                 Вн_Запрос.ЗерноваяРасписка
	|
	|ИТОГИ
	|	СУММА(КоличествоНачальныйОстатокДт),
	|	СУММА(КоличествоКонечныйОстатокДт),
	|	СУММА(КоличествоОборотДт),
	|	СУММА(КоличествоОборотКт)
	|ПО
	|	ОБЩИЕ,
	|	ХПП
	|АВТОУПОРЯДОЧИВАНИЕ";	
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапрос()

Функция ПолучитьВидПогашения(ХПП,ЗерноваяРасписка)
	
	мВидыСубконто = Новый Массив;
	мВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Склады);
	мВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Партии);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("мВидыСубконто", мВидыСубконто);
	Запрос.УстановитьПараметр("ВыбСчетУчета", СчетУчета);
	Запрос.УстановитьПараметр("ХПП", ХПП);
	Запрос.УстановитьПараметр("ЗерноваяРасписка", ЗерноваяРасписка);
	
	ТекстУсловия = "СубконтоКТ1 = &ХПП И СубконтоКТ2 = &ЗерноваяРасписка";
	Союз = " и ";
	
	Если ОтборОрганизации Тогда
		
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Если ВидСравненияОрганизации = ВидСравнения.Равно Тогда
			ВидСравненияОрганизацииСтрокой = " = &Организация" 
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.НеРавно Тогда
			ВидСравненияОрганизацииСтрокой = " <> &Организация"
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.ВСписке Тогда
			ВидСравненияОрганизацииСтрокой = " В (&Организация)"
		Иначе
			ВидСравненияОрганизацииСтрокой = " НЕ В (&Организация)"
		КонецЕсли; 
		
		ТекстУсловия = ТекстУсловия + Союз + "Организация " + ВидСравненияОрганизацииСтрокой;
		Союз         = " И ";
		
	КонецЕсли;
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Вн_Запрос.Регистратор) = ТИП(Документ.ур_РеализацияЗерна)
	|			ТОГДА ""реал.""
	|	    	ИНАЧЕ 
	|				ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(Вн_Запрос.Регистратор) = ТИП(Документ.ур_ПереоформлениеЗерновыхРасписок)
	|					ТОГДА ""замена""
	|	    			ИНАЧЕ 
	|						ВЫБОР
	|							КОГДА ТИПЗНАЧЕНИЯ(Вн_Запрос.Регистратор) = ТИП(Документ.ур_СписаниеЗерна)
	|							ТОГДА ""спис.""
	|	    					ИНАЧЕ
	|								ВЫБОР
	|									КОГДА ТИПЗНАЧЕНИЯ(Вн_Запрос.Регистратор) = ТИП(Документ.ур_ПереоформлениеРесурсов)
	|									ТОГДА ""перевод.""
	|	    							ИНАЧЕ
	|										ВЫБОР
	|											КОГДА ТИПЗНАЧЕНИЯ(Вн_Запрос.Регистратор) = ТИП(Документ.ур_ПеремещениеЗерна)
	|											ТОГДА ""перемещ.""
	|	    									ИНАЧЕ
	|											""""
	|                   					КОНЕЦ	
	|                   			КОНЕЦ	
	|                   	КОНЕЦ	
	|                КОНЕЦ
	|	КОНЕЦ КАК ВидПогашения
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ТиповойОборотыДтКт.Регистратор) КАК Регистратор
	|	ИЗ
	|		РегистрБухгалтерии.Типовой.ОборотыДтКт(&НачПериода, &КонПериода, Регистратор, , , СчетКт В ИЕРАРХИИ (&ВыбСчетУчета), &мВидыСубконто, "+ТекстУсловия+") КАК ТиповойОборотыДтКт
	|   ГДЕ ТиповойОборотыДтКт.КоличествоОборотКт > 0
	//|	Упорядочить ПО ТиповойОборотыДтКт.Регистратор Убыв 
	|	СГРУППИРОВАТЬ ПО
	|		ТиповойОборотыДтКт.СубконтоКт1,
	|		ТиповойОборотыДтКт.СубконтоКт2
	|	) КАК Вн_Запрос
	|";
	
	тз = Запрос.Выполнить().Выбрать();
	Если тз.Следующий() Тогда
		Возврат тз.ВидПогашения;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

Процедура СформироватьОтчет(ДокументРезультат) Экспорт	
	
	ДокументРезультат.Очистить();
	
	Макет 		 = ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	СтрокаОтбора = "Отбор:";
	
	Если ЗНАЧЕНИЕЗАПОЛНЕНО(СчетУчета) Тогда
		СтрокаОтбора = СтрокаОтбора + СчетУчета.Код+":"+СокрЛП(счетУчета.Наименование);
	Конецесли;
	
	// Информация об отборе.
	Если ОтборОрганизации Тогда
		
		СписокОтборПоОрганизации = "";
		
		Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
			Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
			Иначе
				СписокОтборПоОрганизации = Организация
			КонецЕсли;
		Иначе
			Если Организация.Количество() = 0 Тогда
			Иначе	
				СписокОтборПоОрганизации =  Организация
			КонецЕсли; 
		КонецЕсли;
		//СтрокаОтбора = СтрокаОтбора + Символы.ПС + СписокОтбор;
		
	КонецЕсли;
	
	
	ОбластьЗаголовок.Параметры.СписокОтборПоОрганизации = СписокОтборПоОрганизации;
	//ОбластьШапка.Параметры.Отбор = СтрокаОтбора;
	
	ТекстПериода = Отчеты_БК.СформироватьСтрокуВыводаПараметровПоДатам(НачПериода, КонПериода);
	
	Если ЗНАЧЕНИЕЗАПОЛНЕНО(СчетУчета) Тогда
		ОбластьЗаголовок.Параметры.ПредставлениеЗаголовка = "по движению зерна "+СокрЛП(счетУчета.Наименование)+" "+ТекстПериода;
	Иначе
		ОбластьЗаголовок.Параметры.ПредставлениеЗаголовка = "по движению зерна "+ТекстПериода;
	КонецЕсли;

	ДокументРезультат.Вывести(ОбластьЗаголовок);
	ДокументРезультат.Вывести(ОбластьШапка);
	
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИТОГО = Макет.ПолучитьОбласть("ИТОГО");
	
	РЕзультат = СформироватьЗапрос();
	
	выборкаОбщие = РЕзультат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Общие");
    выборкаОбщие.Следующий();
	
	ВыборкаПоХПП = выборкаОбщие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ХПП");
	
	НомПП=0;
	
	Пока  ВыборкаПоХПП.Следующий() Цикл
		
		ВыборкаПоДокументам = ВыборкаПоХПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока  ВыборкаПоДокументам.Следующий() Цикл
			
			НомПП = НомПП+1;
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаПоДокументам);
			
			ОбластьСтрока.Параметры.НомПП = НомПП;
			ОбластьСтрока.Параметры.КодМСХ = ВыборкаПоДокументам.ЗерноваяРасписка.КодМСХ;
			ОбластьСтрока.Параметры.СерияНомерМСХ = ВыборкаПоДокументам.ЗерноваяРасписка.СерияНомерМСХ;
			ОбластьСтрока.Параметры.ДатаВыдачи = ВыборкаПоДокументам.ЗерноваяРасписка.ДатаВыдачи;
			ОбластьСтрока.Параметры.Поставщик = ВыборкаПоДокументам.ЗерноваяРасписка.УчастникЕЗХ;
			
			ОбластьСтрока.Параметры.ВидКультуры = ВыборкаПоДокументам.ЗерноваяРасписка.ВидКультуры;
			ОбластьСтрока.Параметры.Класс = ВыборкаПоДокументам.ЗерноваяРасписка.КлассностьКультуры;
			ОбластьСтрока.Параметры.ГодУрожая = ВыборкаПоДокументам.ЗерноваяРасписка.ГодУрожая;
			
			ОбластьСтрока.Параметры.Влажность = ВыборкаПоДокументам.ЗерноваяРасписка.Влажность;
			ОбластьСтрока.Параметры.СорнаяПримесь = ВыборкаПоДокументам.ЗерноваяРасписка.СорнаяПримесь;
			ОбластьСтрока.Параметры.ЗерноваяПримесь = ВыборкаПоДокументам.ЗерноваяРасписка.ЗерноваяПримесь;
			ОбластьСтрока.Параметры.Зараженность = ВыборкаПоДокументам.ЗерноваяРасписка.Зараженность;
			ОбластьСтрока.Параметры.Натура = ВыборкаПоДокументам.ЗерноваяРасписка.Натура;
			ОбластьСтрока.Параметры.Клейковина = ВыборкаПоДокументам.ЗерноваяРасписка.Клейковина;
			ОбластьСтрока.Параметры.Стекловидность = ВыборкаПоДокументам.ЗерноваяРасписка.Стекловидность;
			ОбластьСтрока.Параметры.Числопадений = ВыборкаПоДокументам.ЗерноваяРасписка.Числопадений;
			ОбластьСтрока.Параметры.Белок = ВыборкаПоДокументам.ЗерноваяРасписка.Белок;
			
			ОбластьСтрока.Параметры.Сорт = ВыборкаПоДокументам.ЗерноваяРасписка.СортСеменногоРесурса;
			ОбластьСтрока.Параметры.Репродукция = ВыборкаПоДокументам.ЗерноваяРасписка.Репродукция;
			ОбластьСтрока.Параметры.КлассПосевногоСтандарта = ВыборкаПоДокументам.ЗерноваяРасписка.КлассПосевногоСтандарта;
			
			ОбластьСтрока.Параметры.ВидПогашения = "";
			
			Если ВыборкаПоДокументам.КоличествоОборотКт > 0 Тогда
				 ОбластьСтрока.Параметры.ВидПогашения = ПолучитьВидПогашения(ВыборкаПоДокументам.ХПП,ВыборкаПоДокументам.ЗерноваяРасписка);
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		ОбластьИТОГО.Параметры.Заполнить(ВыборкаПоХПП);
		ОбластьИТОГО.Параметры.ПредставлениеИтого = "ИТОГО";
		ДокументРезультат.Вывести(ОбластьИТОГО);
	КонецЦикла;           	
	
		ОбластьИТОГО.Параметры.Заполнить(выборкаОбщие);
		ОбластьИТОГО.Параметры.ПредставлениеИтого = "Всего по области";
		ДокументРезультат.Вывести(ОбластьИТОГО);
	
КонецПроцедуры // СформироватьОтчет()

#КонецЕсли
